<!DOCTYPE html>
<html>

<head>
    <title>Fontes</title>
    <meta charset="utf-8">
    <meta name="Author" content="Sandro">
    <meta name="descrition" content="Lista de documentos">
    <meta name="keywords" content="html5, tecnologia, fontes, html, css, javascrip, programacao, letras">
    <link rel="stylesheet" href="css/fonte.css">

</head>

<body>

    <header>
        <h1>Fam&iacute;lias de Fontes</h1>

        <p>
            Depois da cor&#44; a fonte &#40;letras&#41; &eacute; provavelmente a mais fundamental propriedade de uma p&aacute;gina&#46; Nesta pag&iacute;na ser&aacute; apresentado toda a variedade de estiliza&ccedil;&atilde;o para fontes oferecida pelas
            <span class="uppercase"><abbr title="Cascading Style Sheets">css</abbr></span>
            </span>&#46;
        </p>

        <p>
            Uma vez que nem todas as fontes existentes est&atilde;o instaladas nos computadores do usu&aacute;rio &#40; existem milhares de fontes e a maioria delas n&atilde;o s&atilde;o gratuita&#41;&#44;
            <span class="uppercase"><abbr title="Cascading Style Sheets">css</abbr></span> fornece um mecanismo para compensar esta lacuna&#46; Voc&ecirc; define uma lista de fontes para o seu documento a serem usadas na ordem que voc&ecirc; definiu &#40;se
            a primeiraa da lista n&atilde;o estiver dispon&iacute;vel no computador do usu&aacute;rio usa&#45;se a segunda e assim por diante&#41; e a &uacute;ltima fonte da lista dever&aacute; ser uma
            <span class="font-01"> Fonte gen&eacute;rica </span> dentre uma das cinco dispon&iacute;veis&#58; <span class="font-01"> &#35;serif&#44; sans-serif&#44; monospace&#44; cursive e fantasy</span>&#46;
        </p>
        <br/><br/>

        <p>
            A tabela a seguir mostra exemplos de v&aacute;rios tipos de fontes &#40; talvez o seu navegador n&atilde;o d&ecirc; suporte para todas elas&#41; e assim voc&ecirc; poder&aacute; visualizar como o seu naveador renderiza cada uma das cinco fontes gen&eacute;ricas&#58;
        </p>
        <br/>
    </header>

    <h2>Fontes</h2>

    <br/>

    <h3>&#39;Sans&#45;serf&#39;&#58; Fontes normais sem serifas&#46;</h3>
    <br/><br/>

    <p class="hero-01">
        Arial&#44; Sans&#45;serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-02">
        Helvetica&#44; Sans-serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-03">
        Verdana&#44; Sans&#45;serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-04">
        Trebuchet MS&#44; Sans&#45;serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-05">
        Gill Sans&#44; sans&#45;serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-06">
        Noto Sans&#44; Sans&#45;serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-07">
        Avantgarde&#44; TeX Gyre&#44; Adventor&#44;URW Gothic L&#44; San&#45;serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso

    </p>
    <br/><br/>

    <p class="hero-08">
        Optima&#44; Sans-serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-09">
        Arial&#44; Narrow&#44; Sans-serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-10">
        Sans-serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso</p>
    <br/><br/>

    <h3 class="serif-01">
        &#39;Serif&#39;&#58; fontes normais com serifas&#46;
    </h3>
    <br/><br/>


    <p class="hero-11">
        Times&#44; Times New Roman&#44; Serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-12">
        Didot&#44; serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-13">
        Georgia&#44; serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-14">
        Palatino&#44; URW Palladio L&#44; Serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-15">
        Bookman&#44; URW Bookmam L&#44; serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-16">
        New Century Schoolbookk&#44; TeX Gyre Schola&#44; serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-17">
        American Typewriter&#44; serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-18">
        serif&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <h3 class="monospace-01">
        Monospace&#58; fontes com largura fixa
    </h3>
    <br/><br/>

    <p class="hero-19">
        Andale Mono&#44; monospace&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-20">
        Courier New&#44; monospace&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-21">
        Courier&#44; monospace&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-22">
        FreeMono&#44; monospace&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-23">
        OCR A Std&#44; monospace&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-24">
        DejaVu Sans Mono&#44; monospace&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-25">
        monospace&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <h3 class="cursive-01">
        &#39;cursive&#39;&#58; fontes simulam manuscrito
    </h3>
    <br/><br/>

    <p class="hero-26">
        Comic Sans MS&#44; Comic Sans&#44; cursive&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso

    </p>
    <br/><br/>

    <p class="hero-27">
        Apple Chancery&#44; cursive&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-28">
        Brandley Hand&#44; cursive&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-29">
        Brush Script MT&#44; Brush Script STD&#44; cursive&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-30">
        Snell Roundhand&#44; cursive&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-31">
        URW Chancery L&#44; cursive&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-32">
        cursive&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>

    <br/><br/>

    <h3 class="fantas-01">
        &#39;fantasy&#39;&#58; fontes decorativas&#44; para t&iacute;tulos e etc&#46;
    </h3>
    <br/><br/>

    <p class="hero-33">
        Impact&#44; fantasy&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-34">
        Luminari&#44; fantasy&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-35">
        Chalkduster&#44; fantasy&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-36">
        Jazz LET&#44; fantasy&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-37">
        Blippo&#44; fantasy&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-38">
        Stencil Std&#44; fantasy&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-39">
        Markker Felt&#44; fantasy&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-40">
        Trattatello&#44; fantasy&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <p class="hero-41">
        fantasy&#58; A &aacute;gil Raposa Marrom Pulou Sobre o C&atilde;o Pregui&ccedil;oso
    </p>
    <br/><br/>

    <h4>Estilos de fontes</h4>
    <br/><br/>

    <p>
        A maioria das fontes admite varias formas de estiliza&ccedil;&atilde;o para a mesma fam&iacute;ia&#44; t&iacute;picamente o <span class="bold-01"> negrito &#40;bold&#41;</span> e o <span class="it"> it&aacute;lico &#40;italic&#41;</span> e frequentemente
        a combina&ccedil;&atilde;o deles&#44; <span class="ni"> negrito it&aacute;lico &#40;bold-italic&#41; </span>&#44; n&atilde;o t&atilde;o frequente a estiliza&ccedil;&atilde;o <span class="sc"> minuscula &#40;small-caps&#41;</span> e em poucos casos
        as versões <span class="mc"> muito claro </span>&#44;
        <span class="me"> muito negrito </span>&#44; <span class="lc"> letras condensadas </span> e <span class="lesp"> letras espa&ccedil;adas </span> &#40;extra-liht/extra-bold or stretched/condensed&#41;&#46;
    </p>
    <br/>

    <p>
        A tabela a seuir mostra diferentes estiliza&ccedil;ões&#46; A menos que voc&ecirc; tenha uma grande cole&ccedil;&atilde;o de fontes instaladas no seu computador voc&ecirc; ver&aacute; a maioria das linhas renderizada de modo id&ecirc;ntico&#46;
    </p>
    <br/><br/>


    <p>Sytles</p>
    <br/><br/>

    <ul>
        <li class="hero-42">font&#45;style&#58; normal</li>
        <p class="hero-43">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-44">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-45">font&#45;style&#58; italic</li>
        <p class="hero-46">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-47">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-48">font&#45;style&#58; oblique</li>
        <p class="hero-49">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-50">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
    </ul>
    <br/>

    <p>Weights</p>
    <br/><br/>

    <ul>
        <li class="hero-51">font&#45;weight&#58; 100</li>
        <p class="hero-52">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-53">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-54">font&#45;weight&#58; 200</li>
        <p class="hero-55">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-56">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-57">font&#45;weight&#58; 300</li>
        <p class="hero-58">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-59">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-60">font&#45;weight&#58; normal</li>
        <p class="hero-61">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-62">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-63">font&#45;weight&#58; 500</li>
        <p class="hero-64">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-65">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-66">font&#45;weight&#58; 600</li>
        <p class="hero-67">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-68">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-69">font&#45;weight&#58; bold</li>
        <p class="hero-70">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-71">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-72">font&#45;weight&#58; 800</li>
        <p class="hero-73">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-74">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-75">font&#45;weight&#58; 900</li>
        <p class="hero-76">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-77">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
    </ul>
    <br/><br/>

    <p>Variants</p>
    <br/>
    <br/>

    <ul>
        <li class="hero-78">font&#45;variants&#58; normal</li>
        <p class="hero-79">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-80">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-81">font&#45;variants&#58; small-caps</li>
        <p class="hero-82">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-83">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
    </ul>
    <br/><br/>

    <p>Stretch</p>
    <br/><br/>

    <ul>
        <li class="hero-84">font&#45;stretch&#58; ultra-condensed</li>
        <p class="hero-85">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-86">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-87">font&#45;stretch&#58; extra-condensed</li>
        <p class="hero-88">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-89">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-90">font&#45;stretch&#58; condensed</li>
        <p class="hero-91">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-92">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-93">font&#45;stretch&#58; normal</li>
        <p class="hero-94">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-95">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-96">font&#45;stretch&#58; semi-expanded</li>
        <p class="hero-97">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-98">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-99">font&#45;stretch&#58; expanded</li>
        <p class="hero-100">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-101">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-102">font&#45;stretch&#58; extra-expanded</li>
        <p class="hero-103">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-104">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
        <li class="hero-105">font&#45;stretch&#58; ultra-expanded</li>
        <p class="hero-106">Com Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <p class="hero-107">Sem Serifa&#58; A &aacute;gil&#46;&#46;&#46;</p>
        <br/>
    </ul>

    <a href="index.html"><button>Voltar</button></a>
</body>

</html>